[Ability.A_magic_reduc_Buff H7BaseBuff]
mName="防护结界"
mTooltip="此生物在 %durnow 回合内承受的所有魔法伤害减少 %res1。"

[Ability.A_MeleeAttack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素攻击"
mTooltip="允许你通过选择伤害源的元素进行攻击。（将光标悬停在目标上以更改元素）"

[Ability.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="防护结界"
mTooltip="保护所有友方单位，在 %buff.buff.durini 回合内减少 %buff.buff.res1 所有形式的魔法伤害。"

[Ability2.A_Provocation_Buff H7BaseBuff]
mName="挑衅"
mTooltip="此生物在 %durnow 回合内造成 %stat1 伤害。"

[Ability2.A_Resurrection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="挑衅"
mTooltip="行动后，此生物降低相邻敌方生物的基础伤害 %buff4.buff.stat1，持续到其下个回合结束。"

[Creature.A_Creature_t2_conflux H7Creature]
mName="源力学徒"
mLore="尽管对大多数人来说，元素魔法与冥想、精神、平静和谨慎这些词相关，但源力学徒往往是元素汇点派系中的喧闹分子。除了源力魔法，他们还掌握其他元素，但不寻求真正控制它们。他们不是有序和谨慎，而是倾向于喧闹和活跃，这在战场上也很明显。"

[Creature.A_Creature_t2_upregate_conflux H7Creature]
mName="源力元素"
mLore="与学徒不同，源力元素学会了不仅照顾自己，也照顾他人。他们使用减少魔法伤害的能力不仅对自己，也对他人，因为谁想最终独自一人在战场上呢？"